In [1]:
import pandas as pd
# Importa a biblioteca de conexão à base de dados
import psycopg2 as pg
from sqlalchemy import create_engine

In [2]:
import psycopg2
conn = psycopg2.connect(
    host="localhost",
    port=5432,
    user="postgres",
    password="123456",
    database="aula16"
)

cursor = conn.cursor()

## Criando tabelas

In [3]:
cursor = conn.cursor()

drop_table_venda = """
DROP TABLE IF EXISTS Venda;
"""
cursor.execute(drop_table_venda)


drop_table_cliente = """
DROP TABLE IF EXISTS Cliente;
"""
cursor.execute(drop_table_cliente)

drop_table_livro = """
DROP TABLE IF EXISTS Livro;
"""
cursor.execute(drop_table_livro)

In [4]:
create_table_cliente = """
CREATE TABLE Cliente
(
 cli_id SERIAL PRIMARY KEY,
 cli_nome VARCHAR,
 cli_endereco VARCHAR
);
"""
cursor.execute(create_table_cliente)

In [5]:
# Crie a tabela livro
create_table_livro = """
CREATE TABLE livro
(
 liv_id SERIAL PRIMARY KEY,
 liv_titulo VARCHAR,
 liv_isbn VARCHAR
);
"""
cursor.execute(create_table_livro)

In [6]:

# Crie a tabela Venda
create_table_venda = """
CREATE TABLE Venda
(
 ven_id SERIAL PRIMARY KEY,
 ven_fret FLOAT,
 ven_valor FLOAT,
 cli_id INT,
 liv_id INT,
 FOREIGN KEY(cli_id) REFERENCES Cliente (cli_id),
 FOREIGN KEY(liv_id) REFERENCES livro (liv_id)
);
"""
cursor.execute(create_table_venda)

In [7]:
conn.commit()
cursor.close()
conn.close()

In [8]:
engine = create_engine('postgresql://postgres:123456@localhost/aula16')
query = "SELECT * FROM cliente"
df = pd.read_sql_query(query, engine)
df

Empty DataFrame
Columns: [cli_id, cli_nome, cli_endereco]
Index: []

## Inserindo valores

In [9]:
import psycopg2
conn = psycopg2.connect(
    host="localhost",
    port=5432,
    user="postgres",
    password="123456",
    database="aula16"
)

cursor = conn.cursor()

In [10]:
insert_cliente = """
INSERT INTO Cliente (cli_nome, cli_endereco)
VALUES (%s, %s);
"""
values_cliente = [("Heinrych", "Rua A"), ("Luan", "Rua B"), ("Maria", "Rua C")]
cursor.executemany(insert_cliente, values_cliente)
conn.commit()

In [11]:
new_name = input("Digite o nome da pessoa: ")
cli_endereco = input("Digite o endereço: ")
cursor.execute(f"insert into cliente (cli_nome, cli_endereco) values {new_name,cli_endereco}")
conn.commit()

cursor.execute('select * from cliente')
print(cursor.fetchall())

[(1, 'Heinrych', 'Rua A'), (2, 'Luan', 'Rua B'), (3, 'Maria', 'Rua C'), (4, 'Joao', 'Rua 15')]

In [12]:
insert_livro = """
INSERT INTO livro (liv_titulo, liv_isbn)
VALUES (%s, %s);
"""
values_livro = ("Livro 1", "ISBN 123")
cursor.execute(insert_livro, values_livro)
conn.commit()

In [13]:
new_livro = input("Digite o nome do livro: ")
new_isbn = input("Digite o isbn: ")
cursor.execute(f"insert into livro (liv_titulo, liv_isbn) values {new_livro, new_isbn}")
conn.commit()

cursor.execute('select * from livro')
print(cursor.fetchall())

[(1, 'Livro 1', 'ISBN 123'), (2, 'submerso', 'sdf454')]

In [14]:
engine = create_engine('postgresql://postgres:123456@localhost/aula16')
query = "SELECT * FROM livro"
df = pd.read_sql_query(query, engine)
df

   liv_id liv_titulo  liv_isbn
0       1    Livro 1  ISBN 123
1       2   submerso    sdf454

In [15]:
insert_venda = """
INSERT INTO venda (ven_fret, ven_valor, cli_id, liv_id)
VALUES (%s, %s, %s, %s);
"""
values_venda = (10, 100, 1, 1)
cursor.execute(insert_venda, values_venda)

In [16]:
ven_fret = input("Digite o valor do frete: ")
ven_valor = input("Digite o valor do livro: ")
cli_id = input("Digite o id do cliente: ")
liv_id = input("Digit o id do livro: ")
cursor.execute("insert into venda (ven_fret, ven_valor, cli_id, liv_id) values"+ 
               f" {ven_fret, ven_valor,cli_id,liv_id} ")
conn.commit()

cursor.execute('select * from venda')
print(cursor.fetchall())

[(1, 10.0, 100.0, 1, 1), (2, 500.0, 10000.0, 2, 2)]

In [17]:
conn.commit()
cursor.close()
conn.close()

In [18]:
engine = create_engine('postgresql://postgres:123456@localhost/aula16')
query = "SELECT * FROM venda"
df = pd.read_sql_query(query, engine)
df

   ven_id  ven_fret  ven_valor  cli_id  liv_id
0       1      10.0      100.0       1       1
1       2     500.0    10000.0       2       2